Fusion_To_TM1/Fusion_To_TM1/Files/Fusion/Currency/SampleCurrency.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:pub="http://xmlns.oracle.com/oxp/service/PublicReportService">
   <soap:Header/>
   <soap:Body>
      <pub:runReport>
         <pub:reportRequest>
            <pub:attributeFormat>csv</pub:attributeFormat>
                                                <!-- Flatten XML should always be false when we have XML type of output to display the XML tags as mentioned in BIP Data Model and display XML structure in as expected format -->
            <pub:flattenXML>true</pub:flattenXML>
            <pub:parameterNameValues>
                  <pub:item>
                  <pub:name>p_frm_conv_dt</pub:name>
                  <pub:values>
                      <pub:item>2021-07-01</pub:item>
                  </pub:values>
                  </pub:item>
				  <pub:item>
                  <pub:name>p_to_conv_dt</pub:name>
                  <pub:values>
                      <pub:item>2021-07-28</pub:item>
                  </pub:values>
                  </pub:item>
            </pub:parameterNameValues>
            <pub:reportAbsolutePath>/Custom/Integration/Reports/SIS Conversion Rate Report.xdo</pub:reportAbsolutePath>
                                                <!-- Setting sizeOfDataChunkDownload to -1 will return the output to the calling client -->
            <pub:sizeOfDataChunkDownload>-1</pub:sizeOfDataChunkDownload>
         </pub:reportRequest>
      </pub:runReport>
   </soap:Body>
</soap:Envelope>